Revit 2026 API

# ScheduleFilterGetDoubleValue Method

---

Gets the filter value for a filter using a double value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetDoubleValue()
```
```vb
Public Function GetDoubleValue As Double
```
```cpp
public:
double GetDoubleValue()
```
```fsharp
member GetDoubleValue : unit -> float
```

#### Return Value

Double The filter value.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The filter value is not a double. |

#### Reference

ScheduleFilter Class

Autodesk.Revit.DB Namespace